---
kind: type
id: T:Autodesk.Revit.DB.DistributionOfNormals
source: html/8e00e7aa-b39b-51b4-26e4-0f5c1404df32.htm
---
# Autodesk.Revit.DB.DistributionOfNormals

An enumeration containing the choices of how normal vectors are assigned
 and distributed along the surface of a polymesh. Planar faces would typically
 have only normal vector associated, but curved faces can have a different
 normal either for each facet (triangle) or each point of the tessellated polymesh.

## Syntax (C#)
```csharp
public enum DistributionOfNormals
```